{
 "_type": "album",
 "api_path": "/albums/9292",
 "cover_art_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
 "cover_art_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
 "full_title": "The Ruler's Back by Slick Rick",
 "id": 9292,
 "name": "The Ruler’s Back",
 "name_with_artist": "The Ruler's Back (artist: Slick Rick)",
 "release_date_components": {
  "year": 1991,
  "month": 7,
  "day": 2
 },
 "url": "https://genius.com/albums/Slick-rick/The-ruler-s-back",
 "artist": {
  "_type": "artist",
  "api_path": "/artists/306",
  "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
  "id": 306,
  "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
  "index_character": "s",
  "is_meme_verified": false,
  "is_verified": false,
  "name": "Slick Rick",
  "slug": "Slick-rick",
  "url": "https://genius.com/artists/Slick-rick"
 },
 "tracks": [
  {
   "number": 1,
   "song": {
    "_type": "song",
    "annotation_count": 3,
    "api_path": "/songs/42724",
    "artist_names": "Slick Rick",
    "full_title": "King by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42724,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1614222925,
    "path": "/Slick-rick-king-lyrics",
    "pyongs_count": null,
    "relationships_index_url": "https://genius.com/Slick-rick-king-sample",
    "release_date_components": {
     "year": 1991,
     "month": 7,
     "day": 2
    },
    "release_date_for_display": "July 2, 1991",
    "release_date_with_abbreviated_month_for_display": "Jul. 2, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 2,
     "hot": false
    },
    "title": "King",
    "title_with_featured": "King",
    "updated_by_human_at": 1614222925,
    "url": "https://genius.com/Slick-rick-king-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "King Lyrics\"I'm the king, I'm the king, I'm the king\" (4X)\n\n[Slick Rick]\nIs there a party over here, wit no guns and knives gettin in?\nNow let and best, get sweat the life threatnin\nNettin is suggestin, guest do the restin\nMic test, KISS, BLS, who the best then?\nCuz when I appear wit hoes off a chair wit\nStare wit, I'm talkin bout a party over here wit\nMain wreckin, girls be checkin, could be neckin\nTo respect and to remember every one of y'all a second to\nRelaxin, gonna be friction, a fraction, attraction\nYou don't wanna see action, I ask then\nScrew, cuz you don't know what the Rick'll do\nGiggle to and as you can see a butt wiggle too\nFried and spin my bride and move your hide and\nNothing but a jammy on my side and\nSo cling on brother's arm, I'm thin\nI'm wonderin, should I begin to kick ya mind and chin\nCuz I'm king\n[Various samples scratched up]\n\n[Slick Rick]\nIf ya forgot who was the man I'll stand and live kid\nYou will be bouncin up and down cuz I'm a grand individual\nShit you will fist and cheer to dear, disappear\nTo where you nowhere near to\nAnd could never dream, run horse for Debra and\nClever trap a hook and screamin on yours forever and\nTown to town wit the B-Boys sounds\nThat has the Ruler Rick announce, which amounts to bounce to\nClassin, still hum the lassin, smash jewelry have like\nKids from the Bassin, cuz bodies lay about\nRespect you better pay about\nObey about, cuz Ricky isin't sweatin what you say about\nHum on the clause, silent jay younger boy\nRap bein strong, cuz see this is violence ya hunger for\nSo cling those on them cling, I'm wonderin\nShould I begin to kick ya mind or chin? Cuz I'm king\n\n[Various samples scratched up]\n\n[Slick Rick]\nLike Ceaser, I wanna chill ho on knees for\nPlease for, breeze, why money grow on trees for\nTen to play, I'm poppin willie on the way in\nTo K, the Rick could make a milly in a day in\nKid shot, cuz we on the boy's hot\nCuz the part don't start that's killin noise fart cuz\nStrive kid, go for the nicest\nOne for the trife shit, run for ya lifest\nAs I scrape hoes, graspin to shape up\nClothes drape, tell me why you blastin the tape up\nAnd up high to, as you boyfriend tried to be\nHoes fly to Vance Wright, tearin inside of me\nSonya, sweat so I bone ya\nLet nobody clone ya, and get what I own ya\nSo hoes cling, those aren't I'm thin\nI'm wonderin should I bring to kick ya mind to chin\nCuz I'm king\nYou might also like[Various samples scratched up]Embed"
   }
  },
  {
   "number": 2,
   "song": {
    "_type": "song",
    "annotation_count": 5,
    "api_path": "/songs/42737",
    "artist_names": "Slick Rick",
    "full_title": "I Shouldn't Have Done It by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42737,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1618796610,
    "path": "/Slick-rick-i-shouldnt-have-done-it-lyrics",
    "pyongs_count": 1,
    "relationships_index_url": "https://genius.com/Slick-rick-i-shouldnt-have-done-it-sample",
    "release_date_components": {
     "year": 1990,
     "month": 11,
     "day": 6
    },
    "release_date_for_display": "November 6, 1990",
    "release_date_with_abbreviated_month_for_display": "Nov. 6, 1990",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 0,
     "hot": false,
     "pageviews": 6280
    },
    "title": "I Shouldn’t Have Done It",
    "title_with_featured": "I Shouldn't Have Done It",
    "updated_by_human_at": 1618796610,
    "url": "https://genius.com/Slick-rick-i-shouldnt-have-done-it-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "I Shouldn’t Have Done It Lyrics[Slick Rick]\nWell, I'mma tell you a story and I come out bluntly\nBorn an ugly child; hey, nobody would want me\nI used to walk around and get upset and upsetter\nTill I figured out ways to make myself look better\nAs I got older, my awareness expanded\nI met this beautiful girl and my wish was commanded\nDidn't hang wit fellas cause they started gettin shady\nI'd always be wit my girl and ya could call her my lady\nI loved her a lot, word up, not going to front, see?\nThe problem that arose is why on earth did she want me?\nCouldn't figure it out, and to make things worst\nI was cursed, wit the torment of not being the first\nAnd the first was this fly guy, made me very jealous\nAlways think she'd cheat on me and talk to other fellas\nTwo wrongs don't make a right, but any time that we fight\nI would call and took a phone and call a girl outta spite\nI shouldn't have done it\n[Hook 2X: scratched up]\nI'm feelin sad and blue\n\n[Slick Rick]\nI will to make this right, so director was admirin\nI tried to stop my love, but no love was not retirin\nTo catch her in a lie was near impossible and tricky\nDidn't want her in certain clothes, gettin really picky\nWe got into it again, this time she got to bright\nSo me preventin a fight, I just stayed out for the night\nI had to ease up of the record, all this hot increase\nI went up to the Parrot, with Omega, Vance, and Dane\nThis girl came over, she was trucked down extensive\nStartin talkin to me, and she was probably quite aggresive\nA pretty young thing, she didn't strike me as no ho\nSo meet my nigga, rude and went on wit the flow\nBut Joe was gettin hard, without me even knowin\nWe stepped up back to my van and I could it's for growin\nThe girl took off her coat her body was no joke\nWell, I rubbed it to unzip it, and I went for broke\nI shouldn't have done it\n\n[Hook 4X: scratched up]\n\n[Slick Rick]\nNow I’ve sinned and there's no one to blame\nThat night when I went home, I felt real guilty and ashamed\nSnucked right into bed, I felt just like a shady fella\nWhat made me so unsensitive, how I'm ever gonna tell her?\nShouldn't have cheated, just because we'd always doubt\nEndurance, be a man, that's what I had to learn about\nHow me, I guess I like the wanted secrets that I did\nI figure, I'd patch things up and then I'll tell what I did\nThen after that, she started actin heaven sent\nI found a house spot, let's say she help out wit the rent\nSo, I bought the ring, it was a good 20 Karat\nThen word got back about me chillin at the parrot\nSo when I got home, I thought she'd just be out to roast\nInstead I found this letter, and I found her overdosed\nIt said \"I had it for you but I guess you didn't care\"\nAll this wouldn't happen come of me and this fear\nI shouldn't have done it\nYou might also like[Hook to fade]1Embed"
   }
  },
  {
   "number": 3,
   "song": {
    "_type": "song",
    "annotation_count": 1,
    "api_path": "/songs/42723",
    "artist_names": "Slick Rick",
    "full_title": "Bond by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42723,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1638828090,
    "path": "/Slick-rick-bond-lyrics",
    "pyongs_count": null,
    "relationships_index_url": "https://genius.com/Slick-rick-bond-sample",
    "release_date_components": {
     "year": 1991,
     "month": 7,
     "day": 2
    },
    "release_date_for_display": "July 2, 1991",
    "release_date_with_abbreviated_month_for_display": "Jul. 2, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 1,
     "hot": false
    },
    "title": "Bond",
    "title_with_featured": "Bond",
    "updated_by_human_at": 1638828090,
    "url": "https://genius.com/Slick-rick-bond-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "Bond Lyrics[Intro]\nYeah, boy!\nCheck it out Slick, ya know what I'm sayin?\n\n[Verse 1]\nNo complaining, I reached my destination and it's rainin'\nI'm in Colombia, the Bond steps off the plane and\nI hear a holler from a bro with ring around the collar\nIt's chief of police, greets Bond, tells me to follow\nTreated me to everything, no taxin', maxin'\nGives me a hotel suite for me to relax in\nSeems everyone was on my silk drawers\nA cloud does it have to bug me a daffy nerve jumpin' out the closet\nWord up, dead nigga said \"Chief, how do you figure?\"\nTryin to arrest me the Double for the murder of the nigga\nNow in a cell, but not for long, and now I'm out I hear a weeping\nOne asleep, other sleeping, kept creeping\nBumped into another, my appearance was alarming\n(To who) some lady that thought I'm charming\nPlease, the way I is I don't even have to say hon\nSo who's a Don? You better believe the nigga kept girl fond\nThe name's Bond!\n[Verse 2]\nWell, I'm outside and it's the chief with twenty thieves like the Brainiac\nBeware because the Double 0 was bucking like a maniac\nTill nobody lives, so hon, nowhere to do correct\nSaid \"excuse me baby, but where they hiding the hooker at?\"\n\"Around the block, but chill at least chill till the storm has stopped\"\nDecided it was a helicopter, sounds like its warming up\nGrabbed ya leg, shot the chief, someone said \"Stop hawking\"\nShook me off at twenty-thou, the Bond got up walking\nThey was laughing as they left they grew thinner like Iraqi\nGot the plans from the dying chief of police in her pocket\nTo make it even worse honey girl was definitely rattin'\nWas holding her in a club that was happening in Manhattan\nI'm on the plane in the day seemed nothing was a phasing\nExcept for the stewardess jocking the Amazing\nBut kept my composure, had another honey hon\nWho the Don? You better believe a nigga kept girl fond\nThe name's Bond!\n\n[Verse 3]\nBack at home in New York, I didn't want to get too overfly\nYou wanna know why I pulled out my 535i? (pimp!)\nBoy I see some lookouts with some girls that was annoyed\nIt was a private engagement for the dealer and the boys\nDouble just passed the hoods with their faces painted\nWalked in, say a good twenty girls fainted\nThrow cousins all out but seems that everyone was shitting\nAnd man I was so cool I even carried me a kitten (reowr!)\nTrouble for the Double 0? Wouldn't swallow that\nWho's the man with the golden gun and all of that\nTurned curls of mercy, left blood on the walls of\nRescued the shorty who was all on the balls of\nWhore said \"You're late!\" I don't wanna hear none of your dissing\nNabbed the cash, made a good twenty million for the mission\nGood job, not to mention had the boss honey hung\nSo who's a Don? Better believe a nigga kept girl fond\nThe name's Bond!You might also likeEmbed"
   }
  },
  {
   "number": 4,
   "song": {
    "_type": "song",
    "annotation_count": 8,
    "api_path": "/songs/42727",
    "artist_names": "Slick Rick",
    "full_title": "Moses by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42727,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1614440800,
    "path": "/Slick-rick-moses-lyrics",
    "pyongs_count": 2,
    "relationships_index_url": "https://genius.com/Slick-rick-moses-sample",
    "release_date_components": {
     "year": 1991,
     "month": 7,
     "day": 2
    },
    "release_date_for_display": "July 2, 1991",
    "release_date_with_abbreviated_month_for_display": "Jul. 2, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 6,
     "hot": false
    },
    "title": "Moses",
    "title_with_featured": "Moses",
    "updated_by_human_at": 1614440800,
    "url": "https://genius.com/Slick-rick-moses-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "Moses LyricsI tried to block it out my mind\n\n[Verse 1]\nAs you see Ruler shows his inquiring noses\nGoing into a story about a kid named 'Moses'\nOnce a prophet was to be born, before anything else furthered\nPharoah orders every first-born son murdered\nOne got away, a girl with prophet bound with her\nGently put him in a basket, went floating down the river\nThen ends up by a Pharoah relative, ol' honey peeped in\nCouldn’t breed herself and was determined to keep him\n“Don’t say a word”, she told her slave who was a real witch\n“Snitch, it’ll definitely be the last day you breathe, bitch”\nWhile kids slaughtered cuz they was in front of them\nSoldiers tellin the king that they murdered every one of them\n\"Thanks\" said Pharoah, guys were a friend to him\nSister showin her baby saying the river god sent him\nTo her brother who arose and said, \"Whoa, sis!\"\nCurious I suppose this, the upwards knows about Moses\n[whistling and samples]\n\n[Slick Rick]\nAs time passes, prove he wasn't the type to beg or borrow\nGrew to conquer land like ain't no tomorrow\nMade the Sun King jealous cuz he couldn't do what Mo' did\n“Pops, I’m not to happy the way y’all jocking this Mo’ kid”\n“Son, this rash behavior ruins every feast or bash\nAnd why complain now, where’s the temple I asked you to build, you piece of trash?\nTwo of you switch, Mo’ you build it and you’ll find a supreme hero”\n“Built it. Anything else you need, Pharaoh?”\nKing here’s startin’ to share my crown, one said, “How can he?”\nBut sister not takin’ any chance and threw the hooker off the balcony\nBut word still got to King, who then cold cursed blessed\nStripped him of his honors and dumped him in the desert\nBut Mo’ returned for the people, with his chest stick out saw\nKing said, “You want war? Make brick without straw!”\nThat’s a son not being king, the shorty no good rose his\nUnhappy I suppose this, the upward knows about Moses\n\n[whistling and samples]\n\n[Slick Rick]\nThe new King said, “As for your threats, brother, stuff it\"\n“Boy, what do I do now?” prayed the Prophet\nThen a vision said “CHILL\" and prophecy filled\nStorm builds, hails of fire, all their first-borns killed\nIt was gettin’ scary for the king, this made the sufferin’ go by merrier\n“You win! Take these peasants, get the flock out of my area!”\nPoor villain, still in heat, didn’t want Mo’ to fulfill ‘em\nWasn’t chillin’ then he flat sent the troop to go and kill him\nSo Mo’ parts the sea, went across and said “Run!” and\nDid some ol’ abracadabra and water fell upon ‘em\nThe soldiers that is, since Moses was suaver\nThen Mo’ in the mountains havin’ a convo with the Father\nCame back with the tens, seen pantyhose droppin’\nPartner swappin’, folks wasn’t into what po’ Mo was poppin’\nSo the Earth shook and killed those, bible text closes\nTalked about a time when idol worshippin’ foes had met Moses\nYou might also like[whistling and samples]2Embed"
   }
  },
  {
   "number": 5,
   "song": {
    "_type": "song",
    "annotation_count": 1,
    "api_path": "/songs/42730",
    "artist_names": "Slick Rick",
    "full_title": "Tonto by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42730,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1614231505,
    "path": "/Slick-rick-tonto-lyrics",
    "pyongs_count": null,
    "relationships_index_url": "https://genius.com/Slick-rick-tonto-sample",
    "release_date_components": {
     "year": 1991,
     "month": 7,
     "day": 2
    },
    "release_date_for_display": "July 2, 1991",
    "release_date_with_abbreviated_month_for_display": "Jul. 2, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 0,
     "hot": false
    },
    "title": "Tonto",
    "title_with_featured": "Tonto",
    "updated_by_human_at": 1648993469,
    "url": "https://genius.com/Slick-rick-tonto-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "Tonto Lyrics[Verse 1]\nOne day fishing heard Indian drums\nSaw a brother, listen too, wife kissin' too\nThen on another mission to\nThe city with the sistas, though was a far distance\nThere’s Lone Ranger outta area that needed my assistance\nTo deliver cash, last man got robbed, pimped\nHe never returned, I said “ok” and put the money in the Fendi\nThen bumped into this girl\nLooked like that that girl on “Mork & Mindy” and\n“How” I said to the white trim, jockin' me the Indian\nComin' in all this heat, the kind for hopin' a chance for ropin' in\n“How’d you like to put your Indian teepee in my openin'?”\nSaid that would be because the nigga wasn’t new to this\nTrue to this, double barrel slide out the uterus\nCalm, started singin' sad popular songs\nTook the money and the hon', screamin' at the top of her lungs\nNow on a hunt, “You carry leaf?” I was about to smoke a blunt\nNo, not without Fronto, screw girl pronto, name: Tonto\n[Verse 2]\nWas extremely pissed, still picturin' screwin' this\nWoo, woo, woo, woo, woo\nI don’t know why the fuck I’m doin' this\nNuisance, brother’s horse tracks, whose to choose?\nSaddle loose, both thirsty cuttin' a cactus for the juice and\nAll of a sudden, these women like model ho’s in Paris\nGanged to rape me, the Indian, I was so embarrassed\nDon’t pull a kid a minute, to give in within a minute\n‘Til I seen a shack yonder, a couple livin’ in it\nShook my hand, friendly manner, though she pack her up and ran her\nCouldn’t stand her, fondle her feathers like she wanted some banana\nLed me to the back of the house, the hands that started track\nUsed it as my marks and then I nearly had a heart attack\nBrush it off, deal wit the floss, way past disgusted\nSaid “What’s the matter, granny? Is your blind ass dusted”\nBack in the hunt, now what do you want, poor granny offered me a blunt\nNo not without Fronto, screwed girl pronto, mean Tonto, grandma\n\n[Verse 3]\nFound they’re small timers after all, wasn’t her intent to brawl\nPulled out my 45, “How, y'all. Up against the wall\n“Where’s the hooker and the money?”, here she came, sweatin' mine\nThen the bitch is pointin' a pistol at my fine behind\nNow she a smart ass, should have figured when gettin' off the hottie\nSo the horse busted in, started lettin' off the shottie\nKilled the men, slapped the girl, ‘cause she figured I’m stuck, trapped in\n“Come on, Rick! A horse cappin’?” Yeah, that’s what the fuck happened\nGrieve the folks, bleedin', sides red, I’m pleased and\nIndeed, now I’ll let the Apache kill the bitch, no I need her\nPlayin' the role, better yet, “Well, is your pole up?”\nSignals from the wife sayin' “What the hell is the holdup?”\nAlthough he scares the honey, hit the switch dares to run it\nCaught and scalped the daffy hooker, said “Bitch, where’s the money?”\nGave it up… hunt done, she wants a blunt and so it’s Fronto\nThat’s not what I want, so drop drawers pronto mean TontoYou might also likeEmbed"
   }
  },
  {
   "number": 6,
   "song": {
    "_type": "song",
    "annotation_count": 6,
    "api_path": "/songs/42726",
    "artist_names": "Slick Rick",
    "full_title": "Mistakes of a Woman in Love With Other Men by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42726,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1605330668,
    "path": "/Slick-rick-mistakes-of-a-woman-in-love-with-other-men-lyrics",
    "pyongs_count": 1,
    "relationships_index_url": "https://genius.com/Slick-rick-mistakes-of-a-woman-in-love-with-other-men-sample",
    "release_date_components": {
     "year": 1991,
     "month": 6,
     "day": null
    },
    "release_date_for_display": "June 1991",
    "release_date_with_abbreviated_month_for_display": "Jun. 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 3,
     "hot": false
    },
    "title": "Mistakes of a Woman in Love With Other Men",
    "title_with_featured": "Mistakes of a Woman in Love With Other Men",
    "updated_by_human_at": 1605330668,
    "url": "https://genius.com/Slick-rick-mistakes-of-a-woman-in-love-with-other-men-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "Mistakes of a Woman in Love With Other Men Lyrics[Slick Rick]\nCall me the freaker, I bump it in ya speaker\nWeek on my birthday, met this girl named Tameka\nAstonishing creature, made the rest look tired\nDesired, that was the beauty I admired\nOut by the 41 Brook, no joke\nCan I have a toke, finally, she smiled and smoked\nGave the girl my number, though I still felt rejected\nHectic, called me more than I expected\nMonths passed by, even lived together and all\nDream come true, until suddenly a call\nOh brother, why do I discover\nMy honey, Tameka, yeah callin me another\nBroke-hearted again, it offend and I pretend\nMistakes of a woman in love with other men\n\"How low can go\"/\"Hold it now\" (4X)\n\n[Slick Rick]\nWell, tried to block it out my mind, here it was again:\nOther men, confronted lady and she said he was a friend\nDidn't believe her, she packed, brave her\nStrange behavior, so silly, we forgave her\nLate again Thursday, alone Rick sat\nLeft flat, look in the mirror and I wonder where she at\nGave the girl my heart and soul, it's after 10\nAnd again couldn't manage if she slept wit other men\nOut wearing my jewelry so you know she looked truck\nStruck 3 o'clock, here she come, fishy like a fuck\nCome and let me smell you, I wanted to say to hell you\nHi honey, sorry I'm late, but let me tell you\nIt's a fast chat, need the phone, slow rollin\nCould you go to the store and get some soda cuz they open\nAgain it offend and I pretend\nMistakes of a woman in love with other men\n\n\"How low can go\"/\"Hold it now\" (8X)\n\n[Slick Rick]\nStrike one, strike two, no exaggeration\nTry to play it off like it was my imagination\nBeer mix wit alcohol, help me to forgive\nDeal wit weak minded and I have no will to live\nI deserve honesty, and treated like a pet\nNow she's being nice, but no I still can't forget\nPut the cards on the table, don't get loud, cut the bull out\nIf you slept wit another man, I'm strong enough to pull out\nShe confess and then she left, smooth\nWanted to kill myself because to live ain't the move\nBroke-hearted again, it offend and I pretend\nMistakes of a woman in love with other men\nOnce again it offend, and I pretend\nMistakes of a woman in love with other men\nOnce again it offend, and I pretend\nMistakes of a woman in love with other men\nOnce again it offend, and I pretend\nMistakes... in love with other men\nYou might also likeHow low can you -- how low can you go (to end)1Embed"
   }
  },
  {
   "number": 7,
   "song": {
    "_type": "song",
    "annotation_count": 0,
    "api_path": "/songs/42731",
    "artist_names": "Slick Rick",
    "full_title": "Venus by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42731,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1655904414,
    "path": "/Slick-rick-venus-lyrics",
    "pyongs_count": null,
    "relationships_index_url": "https://genius.com/Slick-rick-venus-sample",
    "release_date_components": {
     "year": 1991,
     "month": 7,
     "day": 2
    },
    "release_date_for_display": "July 2, 1991",
    "release_date_with_abbreviated_month_for_display": "Jul. 2, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 0,
     "hot": false
    },
    "title": "Venus",
    "title_with_featured": "Venus",
    "updated_by_human_at": 1655904414,
    "url": "https://genius.com/Slick-rick-venus-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "Venus Lyrics[Intro]\nAll the lonely guys.. {*echoes*}\n\n[Verse]\nJust gettin' off my job, ‘round Wall Street, with the ties on\nFinest girl, a brother think he ever set eyes on\nNice day, weather sunny, as he made a run for honey\nWith a warm personality, well it’s on the money\nI’d have tounged her right there, seemed kinda fun up there\nWonderin’ there, as he tellin' me he could get the underwear\nMeanwhile, still jockin' her, like a real sucka\nSister wench was so fine, she could have AIDS, I’ll still knock her\nHeart beatin' for her since a brother didn’t figure meetin'\nAs I ask her if she’s single, “yeah, caught my nigga cheatin'”\n“Nice to meet ya,” leaves… she had dope combined features\nWatched her walk away and observin' the fine creature\nNext day again, went in uninvite[d], super angry with us\nRan into so much that her and her friends had start to hang with us\nThey pair and move, though fine, they both swine\n“Can I take you out to movies wine, dine, the whole nine?”\nShe condones, good riddance, nigga slid this on her\nDidn’t want to get to bone her, though I knew I didn’t own her\nAnd I could’ve made a move, a little will power ‘cause although\nThat she told me she liked him as a friend and that was all\nAnd since hang with us, she already told her, cool he freaked her\nThe week on my birthday bought me a pair of Gucci sneakers\n“Did she like me?”, racin’ the thought. “Was it a sign?” Guess it weren’t immoral\nWhen she saw me, definitely this is kinda special\nSince for this dish, none abate, but everybody wanna play\n“How long is money gonna wait?” So I asked a honey on a date\nAnd she accepts, though thought it wasn’t much [of] a plan\nWindows On the World, even had the nerve to touch her hand\nThough not lookin' at. Bashful? No, sir\nSuppose I was so shy and then the hon' pulls closer\nThought “clever hint”, so what she straight, never been so excited\nAnd convinced, kiss, in heaven ever since\nHoldin' her hand too, chillin', future plan to build\nCouldn’t believe my dream fulfilled and then that girl began to ill by sayin:\n[Hook]\nLady if you will\nSay you’re the one that sent for me to thrill\nSomeone that I can hold close in my arms\nWith all the charms of you\nAll the charms of you\nOf a lady, this world is just for ladies\nA heart screams out to ladies\nA world of love’s for youYou might also likeEmbed"
   }
  },
  {
   "number": 8,
   "song": {
    "_type": "song",
    "annotation_count": 1,
    "api_path": "/songs/42745",
    "artist_names": "Slick Rick",
    "full_title": "Ship by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42745,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1518290503,
    "path": "/Slick-rick-ship-lyrics",
    "pyongs_count": null,
    "relationships_index_url": "https://genius.com/Slick-rick-ship-sample",
    "release_date_components": {
     "year": 1991,
     "month": 7,
     "day": 2
    },
    "release_date_for_display": "July 2, 1991",
    "release_date_with_abbreviated_month_for_display": "Jul. 2, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 1,
     "hot": false
    },
    "title": "Ship",
    "title_with_featured": "Ship",
    "updated_by_human_at": 1540312101,
    "url": "https://genius.com/Slick-rick-ship-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "Ship Lyrics\"Yes, yes the original\"\n\"Ricky, you the nigga don't forget it\" (6X)\n\"Ok, ok, ok, ok\" (6X)\n\n[Verse 1: Slick Rick]\nWell as you know, thousand tear off their blouse\nBe aroused, have a spouse, try 'member who house\nAnd big hitter in leavin' a fitter in literin'\nGet rid of considerin', rocks glitterin'\nWalkin' over like a hawk and stalkin', king souls\nEvery one walkin', one of a batch, want a hatch for a poppin'\nWhen a catch for a play in batch four another match for\nAs can vision upon pull, now it's all full to a rich or for the poor\nWithout no more delays, sissy world flips, [?]\nBecause of our way, niggas yell, hiphiphoorayin'\nIs it? So as the next kiss it, and a sex miss it\nRemain the exquisite, as I shower the hits\nBest split or let me see you overpower me twit, 'cause I ship\n[Samples]\n\n[Verse 2: Slick Rick]\nBlocks and blocks stare in the jocks\nHip hop the fox, knock niggas out box\nWit the fly green socks and the limelight flappin\nIt's nothin dap in this, so champion of rappin is\nBrother girl fiend brought a jugga\nThough I overlook her, being dream but a hooker\nYo who got things sowed, one guessed it\nBlessed with, he can't mess wit\nBulletproof vest sweat like doors like Coron'\nHello psycho home, pass that microphone\nHearin', whole world cheerin'\nNun scaring, eight million dollar ring wearing\nSo let it be as the world said it\nCold sweat it, Ricky you the nigga don't forget it\nAs I shower the hits, he best split\nOr let me see you overpower me twit, 'cause I ship\n\n[Samples]\n\n[Verse 3: Slick Rick]\nYo, why in the world is rap white wind\nThen sent for a mental, who dance or I enter\nPresent to the fans, who want a picnic bent\nTo get sent to spray praises on new found intellect\nThough I'm wettable, who fedeble, unedible\nMic said mad incredible\nNever heard of us, when your words are dust\nSend you move like murderers, not murderers proud to say\nGirls go 'wow' and 'ow' to now show ya how to bow to\nScoop-a, in the train goopa, don't bloop a\nWhat, Rick you playin supa dupa\nHow Slick ya? You best get the picture\nThe one eyed kid, remain victor\nAs I shower the hits, he best split\nOr let me see you overpower me twit, 'cause I shipYou might also likeEmbed"
   }
  },
  {
   "number": 9,
   "song": {
    "_type": "song",
    "annotation_count": 5,
    "api_path": "/songs/42722",
    "artist_names": "Slick Rick",
    "full_title": "It's a Boy by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42722,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1655905624,
    "path": "/Slick-rick-its-a-boy-lyrics",
    "pyongs_count": null,
    "relationships_index_url": "https://genius.com/Slick-rick-its-a-boy-sample",
    "release_date_components": {
     "year": 1991,
     "month": 11,
     "day": 21
    },
    "release_date_for_display": "November 21, 1991",
    "release_date_with_abbreviated_month_for_display": "Nov. 21, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 5,
     "hot": false
    },
    "title": "It’s a Boy",
    "title_with_featured": "It's a Boy",
    "updated_by_human_at": 1655905624,
    "url": "https://genius.com/Slick-rick-its-a-boy-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "It’s a Boy Lyrics[Verse 1]\nIt's me at last, the Rickster, Def Jam's where I be at\nAnd most agree it’s kinda amazing folks are born from where we pee at\nThough I definitely fiend it, baby no way, chills, clever mean it being\nGot to be careful (…be told), commercial ever seen it?\nWant a few hot ropes, some ask am I cheatin’, do I? Nope\nNot a dope, love the mother, also loves me too I hope\nSo I dig her a lot and although shorty honey break a nigga\nHow you figure? Bein’ a big rap money makin’ nigga\nCute as a button, he tell ’bout the time we picked for cotton\nSo it ain’t forgotten, hope I don’t spoil the nigga rotten\nAlso, don’t discriminate white, he’ll be quite bright, if taught him right\nIf not he like ask heavenly father, help me raise my shorty right\nSo when I come home with the coil, I say “yo shorty run to royal”\nSeein’ as I’m loyal and livin’ on soil, it’s best when you have someone to spoil\nSo any toy, he wants he gets, yo kids ain’t worth it midst the toys\nThat they destroy, annoy, though me and his moms in middle of fits of joy and it’s a boy\n[Verse 2]\nPicture friends, milk and cookies, when you’re done with the boy’s game\nToy plane, Ricky Jr. being the bundle of joy’s name\nAnd furthermore teach birds and bees\nSo won’t be a nerd and burst herds of, second and thirds of\nAnd “Dada” better be the first words of\nJust kiddin’, son’ll be [need] a one man girl, spend a lot on what I be wearin’\nBest of care, best that money can buy is what he’ll be wearin’\nWith these weathers around, protect him, they’ll say in a cage I kept him\nThough wage you kindergarten probably be another major step and\nLo and behold a star holdin’, ‘cause yo be loadin’ trips and sowin’\nYa knowin’? Throw in a fancy home for him to grow in\n“He’s kinda pleasin’ to raise\"… so baby say. No thank you… ease in\nSneezin’, now what do I do when he cry for no reason?\nThough any toy, he want he get, yo kids it ain’t worth it, midst the toys\nThat they destroy, annoy, though me and his moms in middle of fits of joy and it’s a boy, yo\n\n[Verse 3]\nBaby mom, under wing, though if dress up, could string\nLine of cuties, though cling, don’t wanna mess up a good thing\nYou know how it is when guys that pay girls seem to hog us\nFiend and dog us, scheme for more guts\nGoin' into labor date, 18 of August\nIt’s that time tellin’ friends, congratulate’s yellin’\nGonna be six weeks premature, but thanks to God, he’s doin’ well\nAnd givin’ credit where it is due, while rap’s achievin’ let it\nAs for bills forget it, ’cause the way I rap, don’t even sweat it\nMy own when me and my hon son, don’t fuss, agree\nThough son, I still kinda wish I coulda been there when he was born at 3:01\nBygone be gone, there’s nowhere wrong and all\nYour son’s about and since I didn’t and this being the first\nYou know I had to write a rap about the incident\nAnd the rose is for the squeeze, I would’ve sent a few no women with the kin in it\nWish us luck, world, as we enter a new beginning\nAnd like I said, any toy, I’m tryin’ to tell ya that midst the toys\nThat they destroy, annoy, though me and his moms in middle of fits of joy and it’s a boyYou might also likeEmbed"
   }
  },
  {
   "number": 10,
   "song": {
    "_type": "song",
    "annotation_count": 0,
    "api_path": "/songs/42733",
    "artist_names": "Slick Rick",
    "full_title": "Top Cat by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42733,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1501526684,
    "path": "/Slick-rick-top-cat-lyrics",
    "pyongs_count": null,
    "relationships_index_url": "https://genius.com/Slick-rick-top-cat-sample",
    "release_date_components": {
     "year": 1991,
     "month": 7,
     "day": 2
    },
    "release_date_for_display": "July 2, 1991",
    "release_date_with_abbreviated_month_for_display": "Jul. 2, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 0,
     "hot": false
    },
    "title": "Top Cat",
    "title_with_featured": "Top Cat",
    "updated_by_human_at": 1648993502,
    "url": "https://genius.com/Slick-rick-top-cat-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "Top Cat Lyrics[Verse 1]\nEatin’ a bit and nap, human being make way spittin’\nAs I’m skippin’ through an alley in New York, a stray kitten\nDog chase couple of blocks, shucks, tough being a fox\nHe in a tux, some good samaritan’ll stuff me in a box\n“I’ll find you a home.” Why do you cry? Where went? Just like whine\n‘Cause ASPCA to me a kitten ain’t like right and\nConstable comes, wonder why? I heard say “unhand the fly kid”\nBecause the bitch looked like she needed a home more than I did\nWord, bit her off another like, not a committee, hit her off\nNot to mention, sweatin’ the kitty litter off\nHad to do this, ain’t no regular, see the loot is\nWith this rich white lady sayin’ “Ain’t he the cutest?”\nClerk said all deals are straight, so when the car wheels away\nAlthough the ho’ better know I want four meals a day\nThe rest is firm bein’ a trap as the hon adopt cat\n“Better be a good lil’ kitty”, hooker don’t pop crap\n‘Cause I’m Top Cat\n[Verse 2]\nLet me hug him for the millionth, and again, great the zillionth\nHuggin’ me so much, she almost suffocate the brilliant\nSad eyes, plus she had a bad pad, nice\nSaid I have to do my share of work, the hooker had mad mice\nWas like a fleet of them niggas, though it was kind of fun to be ill treatin’ them, clean the mess, must’ve thought I was gonna eat ‘em\nCat food, this ain’t none to me, see a rat, you come run\nOr like “hunt” to me, “you wanna get this shit from in front of me?”\nWord, Thanksgiving too? Please, now shout for somethin\"\n“Can a nigga get some air”, she wouldn’t let me out for nothin’\nI guess I could be called a brat and now a jolly ball of fat\nSo let me rub my head against her, so she think she all of that\nAnd every day of the week, sweatin’, works like a sinner, stay off\n“Would you lay off? I’m watchin’ Prince of Bel-Air, you’re in the way of”\nMouse race across the room, should’ve seen me stop trap\nYou’re still a hooker snap, didn’t I tell you don’t pop crap?\n‘Cause I’m Top Cat\n\n[Verse 3]\nMale come and the sex triggers, and his penis stiffer, bigger\nSaid “boy she sure be sleepin’ with a lot of different niggas”\nTen positions as he coaches, do it in the mood above reproaches\nI wish the bitch would clean her house, you wouldn’t have so many roaches\nBut still he buggin’ and he comin’, and the naughty with the hottie\nFall asleep, burglar come, “up shorty get the shottie!”\nTried meowin’, nothin’ stirred him\nThe ho’s meal blurred him\nPeed on a bitch, got up and chased me ’til she heard him\n“What was that?” Got her gun, she had a dozen, mad lot\nAnd for a over horny lady, definitely wasn’t a bad shot\nPolice came and all of that and now a hero hops, run to her\nSo I snuggle up under her, ’cause I’ve kind of grown fond of her\nWhen a mouse run across, should’ve seen me stop trap\nI thought the ho was gonna snap, she better not pop crap\nTo who? Top CatYou might also likeEmbed"
   }
  },
  {
   "number": 11,
   "song": {
    "_type": "song",
    "annotation_count": 0,
    "api_path": "/songs/42725",
    "artist_names": "Slick Rick",
    "full_title": "Runaway by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42725,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1529426768,
    "path": "/Slick-rick-runaway-lyrics",
    "pyongs_count": null,
    "relationships_index_url": "https://genius.com/Slick-rick-runaway-sample",
    "release_date_components": {
     "year": 1991,
     "month": 7,
     "day": 2
    },
    "release_date_for_display": "July 2, 1991",
    "release_date_with_abbreviated_month_for_display": "Jul. 2, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 0,
     "hot": false
    },
    "title": "Runaway",
    "title_with_featured": "Runaway",
    "updated_by_human_at": 1648993515,
    "url": "https://genius.com/Slick-rick-runaway-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "Runaway Lyrics[Slick Rick]\nWell, I waited long time sweatin it\nGettin jerked but yea I'm gettin it\nEarly mornin, stiff's the dawnin' of\nCuz a brother give the warnin' of\nA new we do we and\nParanoid to near silly and\nI said meet me in the lobby skip\nSo one could cut down on the chubby tip\nAlright, he flighty scared\nTo be in fear to show a mighty that\nLa Di Da Di wanted Gotti and\nAlthough depending on the body and\nWho I know was gonna runaway, how am I to live to serve the next day\nWhen I know she's gonna be wit him, so hallelujah, praise God's King\n[samples]\n\n[Slick Rick]\nCheck it out, even candle light I figure and\nBetter handle it my nigga and\nI think the best thing is to block her out\nCuz she doesn't give a fuck about\nSomeone change the choony and\nYou would of cared to wish the u-nion\nShe's not a phony, turn the Sony off\nYou better overcome the lonely of\nAlthough a brother leaden bad\nThus don't know where I'm headin at\nYou see, cause even though we fought a bit\nI find that just the very thought of it\nWhen I know she's gonna runaway, how am I to live to serve the next day\nWhen I know she's gonna be wit him, so hallelujah, praise God's King\nAnd I know you're gonna runaway, am I to live to serve the next day\nWhen I know you gonna be wit him, can't believe that this is happenin\n\n[samples]\n\n[Slick Rick]\nWell, I should say fine phoney gone\nAlthough you say that I'm the only one\nBut, behind my back's thinkin of\nHer father not the one I'm thinkin of\nI'm distrustful what one done to end\nDown wit this burden here I'm wonderin\nI know I should say fine fair to ya\nAnd think about all the girls ahead of ya\nThough hard for me to just forget her and\nTry to follow to the letter end\nAlthough the terrible things we riff about\nHer father wise that I can't live without\nWhen I know you're gonna runaway, how am I to live to serve the next day\nWhen I know you gonna be wit him, so hallelujah, praise God King\nWhen I know you're gonna runaway, am I to live to serve the next day\nWhen I know you gonna be wit him, can't believe this is happenin\nI know you're gonna runaway, I know you're gonna be wit him\nSeems I know you're gonna runaway, I know you're gonna be wit him\nCan't believe this is happeninYou might also likeEmbed"
   }
  },
  {
   "number": 12,
   "song": {
    "_type": "song",
    "annotation_count": 5,
    "api_path": "/songs/42732",
    "artist_names": "Slick Rick",
    "full_title": "The Ruler by Slick Rick",
    "header_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "header_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "id": 42732,
    "instrumental": false,
    "language": "en",
    "lyrics_owner_id": 50,
    "lyrics_state": "complete",
    "lyrics_updated_at": 1614223053,
    "path": "/Slick-rick-the-ruler-lyrics",
    "pyongs_count": null,
    "relationships_index_url": "https://genius.com/Slick-rick-the-ruler-sample",
    "release_date_components": {
     "year": 1991,
     "month": 7,
     "day": 2
    },
    "release_date_for_display": "July 2, 1991",
    "release_date_with_abbreviated_month_for_display": "Jul. 2, 1991",
    "song_art_image_thumbnail_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.300x300x1.jpg",
    "song_art_image_url": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg",
    "stats": {
     "unreviewed_annotations": 3,
     "hot": false
    },
    "title": "The Ruler",
    "title_with_featured": "The Ruler",
    "updated_by_human_at": 1648993527,
    "url": "https://genius.com/Slick-rick-the-ruler-lyrics",
    "featured_artists": [],
    "primary_artist": {
     "_type": "artist",
     "api_path": "/artists/306",
     "header_image_url": "https://images.genius.com/3c7fd9e0c5f32f93bcd2460ed7701724.715x402x1.jpg",
     "id": 306,
     "image_url": "https://images.genius.com/5f4d75aded5ef0d74dba14238567f9f2.750x750x1.jpg",
     "index_character": "s",
     "is_meme_verified": false,
     "is_verified": false,
     "name": "Slick Rick",
     "slug": "Slick-rick",
     "url": "https://genius.com/artists/Slick-rick"
    },
    "artist": "Slick Rick",
    "lyrics": "The Ruler Lyrics[Slick Rick]\nBeen a public figure for quite a long time\nKnown to the whole world (for what?) style of rhyme\nBut tonight let's talk about the ones who bite\nAlthough they know, they won't ever get it right\nCuz they got no class, and they have no game\nAnd can't find another brother who boost it on pain\nAnd hey hooray, on a one-way give me\nI pack for ya lover, for them, cuz Slick Ricky is a\n\n[samples]\n[Slick Rick]\nWalk into a party, come smart and laugh\nAs the girls go crazy, want me for my dear autograph\nAnd it's me they be admirin, my new style of rappin\nAnd brothers go around me, how I done the insanity\nThe girls say \"wow\" they can't spell the hate\nSay fellas how you organize the word's today\nOn my will says \"chill\" and I do it by my way\nCuz that's how we port son, represent, represent\n\n[samples]\n\n[Slick Rick]\nRemember one night when the world was dead quiet\nAnd outta nowhere some boys start a riot\nTake off my clothes, I had to throw blows\nThe shotgun barrel and dead on my toes\nThe pros, it was people and the knows\nHad a bunch of small timers, the people on my show\nSurround it and bring it wit my empty shift\nAnd said um, will you teach us how to rap, no doubt\n\n[samples]You might also likeEmbed"
   }
  }
 ]
}